[
    {"title":"Pil-pil Shrimps",
    "ingredients": ["1/2 kg of fresh shrimps", "1/2 cup olive oil, 5 cloves of garlic", "cayenne pepper", "1 teaspoon pimenton/smoked paprika", "fresh parsley"],
    "creator": "Jose",
    "shortDescription": "Nice and easy way of cooking shrimp",
    "imageUrl": "https://i.imgur.com/68FgT2e.jpeg",
    "cookingSteps": "Clean the shrimps and remove the shells and heads (you can use them to make stock, but you don't need them for this recipe). Salt them, then slice the garlic cloves. Ideally, you should use a shallow clay pot, but a regular small pan works just fine. Add the olive oil, garlic and cayenne peppers (one is enough, feel free to add more). When the garlic starts to get some color, add the shrimps, cook for 30 seconds, then add the pimenton and chopped parsley. Let cook for other 30 seconds or until shrimps are cooked through. Serve hot and get some bread because you're definitely dipping in that oil.",
    "dietRestriction": ["Gluten-free"],
    "level": "Easy",
    "cuisine": "Spanish",
    "dishType": "Appetizer",
    "public": true
    },
    {"title":"Spanish omelette",
    "ingredients": ["6 eggs", "1kg of potatoes", "olive oil", "1 onion"],
    "creator": "Jose",
    "shortDescription": "One of the most iconic Spanish recipes",
    "imageUrl": "https://i.imgur.com/K8sSfBj.jpeg",
    "cookingSteps": "Peel and cut the potatoes in slices, approximately 2cm thick. The thickness is not as important as trying to cut them all evenly. In nonstick pan, heat a good amount of olive oil. If you think you put way too much it's probably enough. Gently cook the potatoes at medium heat for 5 to 10 minutes, then add the chopped onions. You can skip the onion if you want, but why would you do that? Cook until potatoes are soft or when they start to brown. Get the potatoes out of the pan (you can reserve the oil and use it up to 3 times). Let the potatoes cool down for a few minutes. In the meantime, beat the eggs, salt them generously and add the potatoes, add the potatoes and onion and mix gently. After heating it up, pour this mixture in the same pan you used before at medium-high temperature. Cook for 3 to 5 minutes, then take a flat plate, put it on top of the pan as if it were a lid, and flip the omelette, then slide it back into the pan to cook the other side. Shape the sides to make it rounder, cook for 2-3 minutes and serve. Goes well with alioli.",
    "dietRestriction": ["Vegetarian", "Gluten-free"],
    "level": "Medium",
    "cuisine": "Spanish",
    "dishType": "Main course",
    "public": true
    },
    {"title":"Salmorejo",
    "ingredients": ["1/2 kg of 1 or 2 days old rustic bread", "1kg of ripe tomatoes", "1 or 2 garlic cloves", "1/2 cup of olive oil","1/2 green bell pepper", "white vinegar", "salt", "Optional: serrano ham bits, hard boiled eggs, sliced almonds, diced peppers, pistachios"],
    "creator": "Jose",
    "shortDescription": "Creamy go-to ",
    "imageUrl": "https://i.imgur.com/JEuH7KL.jpeg",
    "cookingSteps": "Clean the tomatoes, cut the stem out and squish them to remove the seeds. Mix them until smooth using a food processor or a blender. In a big bowl, put the white part of the bread cut into peaces, put your tomato mixture in and let it soak for at least 10 minutes. You can use the discarded bread crust later to make breadcrumbs if you want. In the food processor, add the tomatoes, bread, green pepper, cored garlic, salt, and a splash of vinegar. Once it's smooth, keep it running and add olive oil little by little until the mixture gets a nice bright orange color. Cool down in the fridge and serve with some drizzled olive oil on top and the garnish of your choice. Traditional ones are diced hard boiled eggs, serrano ham or canned tuna, but it's great with sliced almonds, in this case I used pickled red onions and pistachios, but get creative and add what you want!",
    "dietRestriction": ["Vegan"],
    "level": "Easy",
    "cuisine": "Spanish",
    "dishType": "Starter",
    "public": true
    },
    {"title":"Pisto",
    "ingredients": ["1 onion", "1 green pepper", "1 red pepper", "1 zuchinni", "1 eggplant", "1 large can of diced tomatoes", "olive oil", "salt", "pepper", "Optional: eggs"],
    "creator": "Jose",
    "shortDescription": "Versatile veggie dish that can be used as a side, sauce, or filling for savory pies",
    "imageUrl": "https://i.imgur.com/W57T2U2.jpeg",
    "cookingSteps": "On a large pan,  cover the bottom with olive oil and set the heat to medium, chop and add the onion, and while it's cooking, chop and add the peppers. Then cut the zuchinni in small cubes and add them to the pan, finally do the same with the eggplant. Remember to stir occasionally to avoid sticking. All the veggies will get cooked while you chop the other ingredients, so just go step by step. Finally add the canned tomatoes, cover the pan and cook for 15 minutes or until everything is soft. You can use fresh, ripe tomatoes instead, just cook a bit longer. Traditionally served with a fried egg and bread to dip.",
    "dietRestriction": ["Vegetarian", "Vegan", "Gluten-free"],
    "level": "Easy",
    "cuisine": "Spanish",
    "dishType": "Side dish",
    "public": true
    },
    {"title":"Pipirrana",
    "ingredients": ["1 cucumber", "1 green pepper", "1 spring/ sweet onion", "2 tomatoes","salt", "olive oil", "white vinegar", "Optional: octopus, shrimps, surimi/crab sticks, or mussels"],
    "creator": "Jose",
    "shortDescription": "Simple and refreshing salad",
    "imageUrl": "https://i.imgur.com/Liz18Wt.jpeg",
    "cookingSteps": "Just chop all the veggies in small, even pieces and mix them together. In this case I just added some pre-coked octopus, but you can use shrimps, mussels, crab sticks or a combination of them all. Drizzle generously with olive oil, salt and vinegar and that's it!",
    "dietRestriction": ["Gluten-free"],
    "level": "Easy",
    "cuisine": "Spanish",
    "dishType": "Salad",
    "public": true
    }

]